In [1]:
import pandas as pd

In [2]:
pd.DataFrame([1,2,3,4])

   0
0  1
1  2
2  3
3  4

In [15]:
df = pd.DataFrame([
    ['Lee', 20, '010-1234-8765', 'M'],
    ['Kim', 25, '010-1234-8765', 'F'],
    ['Choi', 26, '010-1234-8765', 'F'],
    ['Park', 30, '010-1234-8765', 'F'],
], columns=['이름', '나이', '전화번호', '성별'], index=[1,2,3,4])

In [16]:
df

     이름  나이           전화번호 성별
1   Lee  20  010-1234-8765  M
2   Kim  25  010-1234-8765  F
3  Choi  26  010-1234-8765  F
4  Park  30  010-1234-8765  F

In [17]:
df.shape

(4, 4)

In [18]:
len(df)

4

In [19]:
df.columns

Index(['이름', '나이', '전화번호', '성별'], dtype='object')

df.loc[]  -> index를 이용해서 조회
df.iloc[] -> 실제 row의 순서를 이용해서 조회

In [21]:
df.loc[3]

이름               Choi
나이                 26
전화번호    010-1234-8765
성별                  F
Name: 3, dtype: object

In [22]:
df.iloc[3]

이름               Park
나이                 30
전화번호    010-1234-8765
성별                  F
Name: 4, dtype: object

In [23]:
df.iloc[2]['나이']

26

In [24]:
df['나이']

1    20
2    25
3    26
4    30
Name: 나이, dtype: int64

In [25]:
df['나이'].sum()

101

In [26]:
df['나이'].min()

20

In [27]:
df['나이'].median()

25.5

In [28]:
df['나이'].var()

16.916666666666668

In [29]:
df['나이'].std()

4.112987559751022

In [30]:
df['나이'].min()

20

In [31]:
df['나이'].max()

30

In [32]:
df

     이름  나이           전화번호 성별
1   Lee  20  010-1234-8765  M
2   Kim  25  010-1234-8765  F
3  Choi  26  010-1234-8765  F
4  Park  30  010-1234-8765  F

In [34]:
df['성별'].value_counts()

성별
F    3
M    1
Name: count, dtype: int64

In [35]:
df[df['성별'] == 'F']

     이름  나이           전화번호 성별
2   Kim  25  010-1234-8765  F
3  Choi  26  010-1234-8765  F
4  Park  30  010-1234-8765  F

In [36]:
df[df['성별'] == 'F']['나이'].mean()

27.0

In [37]:
df[df['성별'] == 'M']['나이'].mean()

20.0

In [38]:
for s in ['M', 'F']:
    print(df[df['성별'] == s]['나이'].mean())

20.0
27.0

In [39]:
df['성별'].unique()

array(['M', 'F'], dtype=object)

In [40]:
for s in df['성별'].unique():
    print(df[df['성별'] == s]['나이'].mean())

20.0
27.0

In [41]:
df.groupby('성별')

In [42]:
list(df.groupby('성별'))

[('F',
       이름  나이           전화번호 성별
  2   Kim  25  010-1234-8765  F
  3  Choi  26  010-1234-8765  F
  4  Park  30  010-1234-8765  F),
 ('M',
      이름  나이           전화번호 성별
  1  Lee  20  010-1234-8765  M)]

In [43]:
df.groupby('성별')['나이'].mean()

성별
F    27.0
M    20.0
Name: 나이, dtype: float64

In [44]:
df

     이름  나이           전화번호 성별
1   Lee  20  010-1234-8765  M
2   Kim  25  010-1234-8765  F
3  Choi  26  010-1234-8765  F
4  Park  30  010-1234-8765  F

In [47]:
(df['성별'] == 'F') & (df['나이'] >= 30)

1    False
2    False
3    False
4     True
dtype: bool

In [48]:
df[(df['성별'] == 'F') & (df['나이'] >= 30)]

     이름  나이           전화번호 성별
4  Park  30  010-1234-8765  F

In [49]:
df

     이름  나이           전화번호 성별
1   Lee  20  010-1234-8765  M
2   Kim  25  010-1234-8765  F
3  Choi  26  010-1234-8765  F
4  Park  30  010-1234-8765  F

In [50]:
df['나이'] * 2

1    40
2    50
3    52
4    60
Name: 나이, dtype: int64

In [51]:
df

     이름  나이           전화번호 성별
1   Lee  20  010-1234-8765  M
2   Kim  25  010-1234-8765  F
3  Choi  26  010-1234-8765  F
4  Park  30  010-1234-8765  F

In [54]:
'010-0000-1111'.split('-')[-1]

'1111'

In [57]:
df['4자리'] = df['전화번호'].str.split('-').str[-1]

In [59]:
df

     이름  나이           전화번호 성별   4자리
1   Lee  20  010-1234-8765  M  8765
2   Kim  25  010-1234-8765  F  8765
3  Choi  26  010-1234-8765  F  8765
4  Park  30  010-1234-8765  F  8765

In [61]:
df.to_csv('result.csv', encoding='utf-8', index=False)

index를 false로 빼주고 저장하는 이유는, Pandas가 csv를 불러올때마다 index가 새로 생겨서

In [62]:
df.to_csv('result2.csv', encoding='euckr', index=False)